{
    "mixins": "/stonehearth_ace/locales/locales_mixin.json",
    "ui": {
        "shell": {
            "loading_screen": {
                "loading_map_flavor_text": {
                    "034": "im Konflikt mit ACE...",
                    "035": "dreht BuckBucks...",
                    "036": "melkt Moo-Moos...",
                    "037": "beendet fischen...",
                    "038": "verbreitet Pilze...",
                    "039": "Marmor in Betracht ziehen..",
                    "040": "fragt sich wo der runde Lehm ist...",
                    "041": "erwartet Zwerge...",
                    "042": "umarmt Hasen...",
                    "043": "findet Käfer...",
                    "044": "zieht einen Absturz in Betracht...",
                    "045": "verzögere Mod-Updates...",
                    "046": "fügt einen Fehler hinzu...",
                    "047": "verschiebe nächste ACE-Version nach hinten...",
                    "048": "trimmt die Grenzen der Welt...",
                    "049": "zerbricht etwas...",
                    "050": "weckt Hearthlinge auf...",
                    "051": "hütet Wombats...",
                    "052": "reinigt die Werkbänke...",
                    "053": "lädt Mondglocken wieder auf...",
                    "054": "kühlt Eisblumen...",
                    "055": "lädt sehr langsam...",
                    "056": "das wird ne Weile dauern...",
                    "057": "Brauereiabenteuer..."
                },
                "tips": {
                    "004": "Du kannst bestimmte Kulturen wie Seidengras oder Baumwolle anbauen, um eine gleichmäßige Zufuhr an Fasern zu erhalten.",
                    "008": "Der Weber kann wetterspezifische Kleidung oder neue Uniformen herstellen, die die Effektivität deiner Arbeiter erhöht.",
                    "010": "Die Schäfer finden automatisch die ersten beiden Tiere, um eine Weide zu starten.",
                    "017": "Du wilsst nicht, dass deine Hearthlinge die Stadt verlassen? Der Ingenieur kann Schlösser für Türen machen.",
                    "020": "Die/Der Trapper/in kann überall Fallen setzen, aber wildere Gebiete mit Vegetation und keinen Zivilisationsanzeichen werden immer besser sein.",
                    "022": "Beim Abbau von Dreck entstehh gelegentlich Lehm, Stein und Raritäten wie Knochen.",
                    "024": "Benötigst du eine erste Nahrungsquelle? Suche nach Obstbüschen oder essbaren Pilzen und bringen Sie näher an dein Dorf heran!",
                    "029": "Weidetiere gehen immer zu freien Tierbetten, wenn das Wetter schlecht. Lege es unter ein Dach, um die Tiere zu schützen!",
                    "030": "Mit einem Fütterungsmanager kannst du sicherstellen, dass deine Weidetiere immer genug Futter zur Verfügung haben.",
                    "031": "Haustiere werden versuchen in dem Haustierbett zu schlafen, das dem Bett seines Besitzers am nächsten ist. Stell einen Futternapf für noch mehr Komfort in die Nähe.",
                    "032": "Futter reicht aus, um ein Tier gesund zu halten, aber nur bestimmte Lebensmittel erhöhen die Qualität tierischer Produkte.",
                    "033": "Du kannst eine gewünschte Anzahl von Tieren festlegen, die auf einer Weide gehalten werden sollen. Alle Tiere über dieser Zahl werden automatisch 'umsorgt'.",
                    "034": "Du kannst Tiere auf einer Weide umbenennen, und Hirten versuchen zu vermeiden, dass benannte Kreaturen automatisch zu 'umsorgen'.",
                    "035": "Die Feldfrüchte haben unterschiedliche und spezifische Bedürfnisse. Du kannst sie herausfinden, indem du mit der Maus über alle Symbole im Fenster Feldfrüchte fährst!",
                    "036": "Unterschiedliche Wetter und unterschiedliche Biome haben dynamische Werte für Feuchtigkeit und Sonnenlicht. Versuche deine Farmen so weit wie möglich zu optimieren!",
                    "037": "Sonnenlicht ist für die meisten Feldfrüchte sehr wichtig. Gebäude und Hindernisse, die die Sonne auf der Ost-West-Achse behindern, werden sich auch auf sie auswirken!",
                    "038": "Feuchtigkeit ist für viele Feldfrüchte sehr wichtig, obwohl einige von ihnen mit wenig oder gar keinem Wasser auskommen können!",
                    "039": "Obwohl selten, kann eine Feldrucht Wasser in bestimmten Mengen oder auf bestimmte Weise benötigen, um zu wachsen. Zum Beispiel verlangt Reis, dass der Acker geflutet ist.",
                    "040": "Kein Wasser ist nicht optimal für Feldfrüchte, aber auch übermäßiges wässern kann nicht gut sein. Achte darauf, dass du das immer im Fenster Feldfrüchte überprüfst!",
                    "041": "Düngemittel können vom Kräuterkundigen hergestellt werden und sind sehr effizient bei der Verbesserung der Qualität der bäuerlichen Ernten.",
                    "042": "Die Verwendung von hochwertigen Ressourcen und Materialien führt zu qualitativ hochwertigeren Produkten, die mehr wert sind und mehr Anklang finden.",
                    "043": "Neue Arbeiter werden mit einem Satz Bronze-Werkzeuge ausgestattet, die durch schnellere und effizientere Werkzeuge aus Eisen und Stahl ersetzt werden können, die vom Schmied hergestellt werden.",
                    "044": "Das Hacken von Feuerholz ist eine einfache und zuverlässige Quelle für Brennstoff, bis man Holzkohle herstellen oder Kohle abbauen kann.",
                    "045": "Das Ernten von Pilzen zerstört die wilde Brut, die Aufrechterhaltung einer stetigen Produktion von Pilzen erfordert das Fachwissen eines Zwergengärtners...",
                    "046": "Der Kräuterkundige ist in der Lage, Bauernsamen der meisten Pflanzen und Bäume aus der Region, in der ihr euch niederlasst, herzustellen.",
                    "047": "Verschiedene kalte Wetterlagen haben unterschiedliche Kältegrade. Schneestürme können sehr gefährlich sein, aber Feuer und spezielle Kleidung können die Auswirkungen lindern.",
                    "048": "Hearthlinge, die an kalten oder eiskalten Tagen ins Wasser gehen, werden durch das gefrierende Wasser verletzt.",
                    "049": "Hearthlinge, die an heißen Tagen ins Wasser gehen, werden für eine Weile erfrischt sein. Badezeit!",
                    "050": "Hüte dich vor wilden Tierhöhlen, wenn du dich niederlässt. Wilde Wölfe oder Bären sind zwar nicht sehr stark, können aber schon früh für Ärger sorgen.",
                    "051": "Achte immer auf eine abwechslungsreiche und herzhafte Ernährung für deine Herzkinder. Viele von ihnen haben bestimmte Nahrungsvorlieben, Unverträglichkeiten oder Geschmäcker.",
                    "052": "Mega Crops haben unterschiedliche und einzigartige Belohnungen von jeder Art von Ernte.",
                    "053": "Herdbewohner tragen lieber warme Kleidung als Kleidung, die im Herbst und Winter Boni bringt.",
                    "054": "Ein gutes Treibstofflager mit verschiedenen Sorten und Typen ermöglicht es euren Handwerkern, eure Produktionslinien zu optimieren.",
                    "055": "Brennholz, Holzkohle und Koks sind Beispiele für handwerklich hergestellte Brennstoffe, die eine einzelne Einheit in mehrere Einheiten verwandeln.",
                    "056": "Ein verbesserter Amboss oder Ofen kann deine älteren in allen Funktionen ersetzen und erlaubt dir, Metalle effizienter zu schmelzen.",
                    "057": "Steinkohle kann in Kohleadern gefunden werden. Bergbau und Handel sind die einzigen Möglichkeiten, sie zu erwerben!",
                    "058": "Schreiner können aus den lästigen Baumstämmen, die herumliegen, schöne Möbel schnitzen!",
                    "059": "Steinmetze können aus den sonst langweiligen Marmorblöcken tolle Statuen formen!",
                    "060": "Verschiedene Waffen und Rüstungen haben neben ihren Schadens- und Schutzwerten zusätzliche Vor- und Nachteile. Lies alle Tooltips!",
                    "061": "Kurzschwerter werden oft als Seitenwaffe eines Ritters betrachtet und bringen außer einer freien Hand für einen vertrauenswürdigen Schild keine Vorteile.",
                    "062": "Streitkolben und Hämmer sind effiziente Ritterwaffen, die die Rüstung ihres Ziels zertrümmern und dem Gegner mehr Schaden zufügen.",
                    "063": "Stangenwaffen, wie Speere und Hellebarden, werden in der Regel von Rittern benutzt und sind sehr gut geeignet, um die Herzen der feindlichen Menge in Angst und Schrecken zu versetzen, allerdings auf Kosten von weniger Schutz.",
                    "064": "Langschwerter sind vielseitige Hiebwaffen und können von Fußsoldaten verwendet werden, um die Beweglichkeit der Feinde zu behindern.",
                    "065": "Äxte und andere leichtere Hiebwaffen können von Fußsoldaten eingesetzt werden, um die Panzerung von Feinden zu durchdringen.",
                    "066": "Zweihändige Waffen sind extrem starke und mächtige Ausrüstungsgegenstände, die einen höheren Grundschaden aufweisen und dem Gegner Wunden zufügen, die ihn über längere Zeit verletzen.",
                    "067": "Bögen und Armbrüste sind beides effiziente Fernkampfwaffen. Bögen können schneller sein, aber Armbrüste sind oft stärker, besonders gegen Rüstungen.",
                    "068": "Leichte und mittlere Rüstungen können von einfachen Soldaten getragen werden, während schwere Rüstungen in der Regel Rittern vorbehalten sind. Je stärker gepanzert ein Hearthling ist, desto tapferer ist er!",
                    "069": "Du kannst die Art der Ausrüstung, die ein Soldat bevorzugt, mit der Umschalttaste in seinem Einheitenrahmen ändern.",
                    "070": "Waffen können im Laufe der Zeit Titel und Ruhm erhalten, abhängig von den Leistungen ihrer Benutzer. Eine betitelte Waffe kann vom Spieler frei umbenannt werden.",
                    "071": "Hearthlinge können im Laufe ihres Lebens verschiedene Titel erhalten, je nachdem, welche erstaunlichen Leistungen sie vollbringen!",
                    "072": "Viele wilde Tiere können dem aufmerksamen Spieler, der ihre Umgebung erkundet, eine interessante Ressource oder einen Nutzen bieten.",
                    "073": "Man kann manchmal Erz finden, wenn man gewöhnliches Gestein abbaut, aber die zuverlässigste Quelle für Erz ist der Abbau von Adern selbst.",
                    "074": "Algen haben einige kulinarische Verwendungsmöglichkeiten, können aber auch getrocknet und von Kräuterkundigen als Kräuter verwendet werden.",
                    "075": "Du fragst dich, was etwas ist? Wenn ein Objekt oder eine Kreatur ein Informationssymbol neben ihrem Namen hat, klicke darauf, um mehr zu erfahren!",
                    "076": "Jeder minderwertige Brennstoff kann zum Anzünden der Feuerstelle verwendet werden, auch Torf oder Braunkohle.",
                    "077": "Dachstuhlmaterial kann leicht gefunden werden, wenn man grasartige Pflanzen wie Sträucher erntet oder einfach die Grasschicht ausgräbt.",
                    "078": "Fanggebiete für Großwild können, wenn auch selten, Bären und andere größere Wildtiere anlocken.",
                    "079": "Brennholzbehälter und Schuppen sind sehr effiziente Möglichkeiten zur Lagerung von Brennmaterial.",
                    "080": "Tonklumpen kann leicht in großen Bergbauvorkommen oder Felsbrocken auf dem Grund von Gewässern wie Seen gefunden werden.",
                    "081": "Warme Mahlzeiten und Getränke wie Tee, Eintöpfe und Suppen geben Herdbewohnern einen Bonus, der sie für einige Zeit vor kaltem Wetter schützt.",
                    "082": "Kalte oder erfrischende Mahlzeiten und Getränke wie Säfte oder Joghurt geben Herdlingen einen Bonus, der sie für einige Zeit vor heißem Wetter schützt.",
                    "083": "Der Kräuterkundige ist in der Lage, Bauernsamen für die meisten in eurem Königreich bekannten Feldfrüchte herzustellen. Tausche sie ein!",
                    "084": "Du kannst die Umschalttaste gedrückt halten, wenn du auf die Schaltfläche 'Craft!' klickst, um das Rezept direkt an den Anfang der Warteschlange zu stellen!",
                    "085": "Getränke können deine Bürger mit verschiedenen Effekten stärken. Probiert sie unbedingt aus!",
                    "086": "Wenn du deine Herdlinge noch nicht mit zubereiteten Getränken versorgen kannst, solltest du ihnen zumindest einen Brunnen bauen.",
                    "087": "Durst wird deine Bürger nicht verletzen. Nur ihre Gefühle!",
                    "088": "Stellen Sie sicher, dass Sie immer Alternativen zu alkoholischen Getränken anbieten. Niemand will, dass seine Bürger den ganzen Tag übermäßig fröhlich sind!",
                    "089": "Herzensmenschen werden immer ein Getränk bevorzugen, das besser zur aktuellen Tageszeit passt, es sei denn, sie lieben etwas anderes.",
                    "090": "Tee steigert die Qualität aller hergestellten Produkte erheblich, macht das Herstellen aber auch etwas langsamer. Gleichgewicht erfordert Geduld!",
                    "091": "Gifte und Toxine? Gifte halten lange an und zehren langsam an der Gesundheit; Gifte verschwinden schnell, haben aber sofortige Auswirkungen.",
                    "092": "Getränke wie Milch oder Säfte gelten als einfach, während komplexere, geschmacksintensive Gebräue wie Spirituosen oder Bier als zubereitet gelten.",
                    "093": "Chitin-Rüstungen können vom Weber hergestellt werden und schützen einen Fußsoldaten niedrigerer Stufe vor einfachen Giften und Toxinen.",
                    "094": "Schlafen ist wichtig! Sorgen Sie für bequeme Schlafräume und persönlich zugewiesene Betten für Ihre Hearthlinge.",
                    "095": "Du träumst von Schafs-Rave-Partys? Klicke auf deine Herzensmenschen, während sie schlafen, um zu sehen, ob sie gute oder schlechte Träume haben...",
                    "096": "Obst- und Nussbäume brauchen lange, bis sie reif sind, aber sie tragen ihre Früchte schon, wenn sie noch klein sind. Je länger sie wachsen, desto größer ist ihr Ertrag.",
                    "097": "Wenn Sie im Herbst beginnen, schauen Sie sich um. Vielleicht gibt es vor dem Winter noch ein paar zusätzliche Nahrungsquellen wie Nussbäume!"
                }
            }
        }
    },
    "entities": {
        "crops": {
            "carrot_crop": {
                "growth_stage": {
                    "000": {
                        "description": "Eine nicht realisierte Karotte."
                    }
                }
            },
            "pumpkin_crop": {
                "growth_stage": {
                    "000": {
                        "description": "Eine nicht realisierter Kürbiss."
                    }
                }
            },
            "watermelon_crop": {
                "growth_stage": {
                    "000": {
                        "description": "Eine nicht realisierte Wassermelone."
                    }
                }
            },
            "turnip_crop": {
                "growth_stage": {
                    "000": {
                        "description": "Eine nicht realisierte Rübe."
                    }
                }
            }
        }
    }
}P
