{
   "mixins": "/stonehearth_ace/locales/locales_mixin.json",
	"ui": {
		"shell": {
			"loading_screen": {
            "loading_map_flavor_text": {
					"034": "conflicting with ACE...",
					"035": "spinning poyos...",
					"036": "milking moo-moos...",
					"037": "finishing fishes...",
					"038": "spreading fungi...",
					"039": "contemplating marble...",
					"040": "wondering where ball clay is...",
					"041": "expecting dwarves...",
					"042": "hugging bunnies...",
					"043": "finding bugs...",
					"044": "contemplating titles...",
					"045": "delaying mod updates...",
					"046": "adding ACE issues...",
					"047": "postponing next ACE release...",
					"048": "trimming the world borders...",
					"049": "breaking something...",
					"050": "waking up hearthlings...",
					"051": "herding wombats...",
					"052": "cleaning workbenches...",
					"053": "recharging moonbells...",
               "054": "chilling frostsnaps...",
               "055": "loading very slowly...",
               "056": "taking a really long time...",
					"057": "brewing adventure..."
            },
            "tips": {
               "004": "You can farm certain crops like silkweed or cotton for a steady supply of thread fiber.",
               "008": "The weaver can craft weather-specific clothing or new uniforms that increases the effectiveness of your workers.",
               "010": "Shepherds will automatically find the first two animals to start a pasture.",                            
               "017": "Don't want your hearthlings to leave town? The Engineer can make locks for doors.",
               "020": "Trappers can set traps anywhere, but wilder areas with vegetation and no signs of civilization will always be better.",
               "022": "Mining dirt will occasionally yield clay, stone, and rarities like bones.",
               "024": "Need a starting food source? Look for fruit bushes or edible fungi and move them closer to you!",
               "029": "Pasture animals will always go for pasture beds when the weather is bad for them. Place these under a roof to protect them!",
					"030": "With a feeding manger you can make sure your pasture animals always have enough fodder available to them.",
					"031": "Pets will try to sleep on the pet bed that is closest to their owner's bed. Keep a food bowl nearby for even more comfort.",
					"032": "Fodder is enough to keep an animal healthy but only specific foods will increase the quality of animal products.",
					"033": "You can determine a desirable amount of animals to keep in a pasture. They will be automatically slaughtered beyond this number.",
					"034": "You can rename animals in a pasture and shepherds will try to avoid automatically slaughtering named creatures.",
					"035": "Farmer crops have different and specific needs. You can find out about them by hovering your mouse over all the icons on the Farm Plot window!",
					"036": "Different weathers and different biomes have dynamic values for humidity and sunlight. Try to optimize your farms as much as you can!",
					"037": "Sunlight is very important for most farmer crops. Buildings and obstacles that obstruct the sun on the east-west axis will also affect it!",
					"038": "Humidity is very important for many farmer crops, although some of them can thrive with little or no water at all!",
					"039": "Although uncommon, a farmer crop might require water in specific amounts or ways to grow. For example, Paddy requires the Farm Plot to be flooded.",
					"040": "No water isn't optimal for farmer crops, but excessive water might not be good either. Make sure to always check the Farm Plot window!",
					"041": "Fertilizers can be created by the Herbalist and are very efficient in increasing the quality of farmer crops.",
					"042": "Utilizing high quality resources and materials will yield higher quality products that are worth more and are more appealing.",
					"043": "New workers are equipped with a set of Bronze Tools that can be replaced for faster and more efficient Iron and Steel tools made by the Blacksmith.",
					"044": "Chopping firewood is an easy and reliable source of fuel until you can produce charcoal or mine coal.",
					"045": "Harvesting fungi will destroy the wild spawn, maintaining a steady production of fungi requires the expertise of a dwarven Grower...",
					"046": "The Herbalist is able to produce Farmer Seeds of most plants and trees from the region you are settling on.",
					"047": "Different cold weathers will have different levels of cold. Blizzards can be very dangerous but fires and specific clothing can ease the effects.",
					"048": "Hearthlings that go into the water on chilly, cold or freezing days will be hurt by the freezing waters.",
					"049": "Hearthlings that go into the water on hot days will be refreshed for a while. Bath time!",
					"050": "Be wary of wild animal dens and caves when settling. Wild wolves or bears aren't really strong but can cause trouble early on.",
					"051": "Always make sure to keep a varied and hearty diet for your hearthlings. Many of them can have specific food preferences, intolerances, or tastes.",
					"052": "Mega Crops have varied and unique rewards from each kind of crop.",
					"053": "Hearthlings will prefer to wear warm clothing over clothing that provides bonuses during the autumn and winter.",
					"054": "Having a good fuel stockpile with different grades and types will allow your crafters to optimize your production lines.",
					"055": "Firewood, Charcoal, and Coke are examples of crafted fuels that will turn a single unit of fuel into multiple units.",
					"056": "An enhanced anvil or furnace can replace your older ones in all functions and will allow you to smelt metals more efficiently.",
					"057": "Hard Coal can be found in coal veins. Mining and trading are the only ways to acquire it!",
					"058": "Carpenters can carve beautiful furniture out of those pesky fallen logs lying around!",
					"059": "Masons can sculpt awesome statues out of the otherwise boring marble boulders!",
					"060": "Different weapons and armor have additional advantages and disadvantages beyond their damage and protection values. Read all the tooltips!",
					"061": "Short Swords are often considered a knight's sidearm and will provide no benefits other than a free hand for a trustworthy shield.",
					"062": "Maces and hammers are efficient knight's weapons that will crush the armor of their target, exposing enemies to more allied damage.",
					"063": "Polearms, like spears and halberds, are usually used by knights and are really good at putting fear in the hearts of enemy crowds at the cost of less protection.",
					"064": "Long swords are versatile slashing weapons and can be used by footmen to hinder the mobility of enemies.",
					"065": "Axes and other lighter, hacking weapons can be utilized by footmen for increased armor penetration against enemies.",
					"066": "Two-handed weapons are extremely strong and powerful pieces of equipment, possessing a higher base damage and inflicting wounds that hurt enemies over time.",
					"067": "Bows and Crossbows are both efficient ranged weapons. Bows can be faster but crossbows are often stronger, especially against armor.",
					"068": "Light and medium armor can be worn by footmen while heavy armor is usually restricted to knights. The more armored a hearthling is, the braver they will be!",
					"069": "You can switch what kind of equipment a soldier will prefer by using the toggle button in their unit frame.",
					"070": "Weapons can get titles and renown over time, depending on the feats of their users. A titled weapon can be freely renamed by the player.",
					"071": "Hearthlings can gain different titles during the course of their lives, depending on what amazing feats they achieve!",
					"072": "Many wild animals can provide some sort of interesting resource or benefit to the wary player that explores their surroundings.",
					"073": "You can sometimes find ore while mining common rock but the most reliable source of ore is mining veins themselves.",
					"074": "Algae have some culinary uses but can also be dried and used as an herb by the Herbalist.",
					"075": "Wondering what something is? If an object or creature has an information icon next to their name, click it to learn more!",
					"076": "Any lower-grade fuel can be used to light the hearth, including peat or brown coal.",
					"077": "Thatching material can be easily found if you harvest grassy plants like shrubs, or simply dig the grass layer.",
					"078": "Trapping zones for big game might, although rarely, attract bears and other larger wild animals.",
					"079": "Firewood holders and sheds are very efficient ways of storing fuel.",
					"080": "Ball Clay can be easily found in large mining deposits, or boulders, at the bottom of water bodies like lakes.",
					"081": "Hot meals and beverages like tea, stews and soups will provide hearthlings with a bonus that protects them from cold weather for some time.",
					"082": "Cold or refreshing meals and beverages like juices or yogurt will provide hearthlings with a bonus that protects them from hot weather for some time.",
					"083": "The Herbalist is capable of creating Farmer Seeds of most of the crops known to your kingdom. Trade away!",
					"084": "You can hold the SHIFT key when clicking the 'Craft!' button to send that recipe straight to the top of the queue!",
					"085": "Drinks can boost your citizens with several different effects. Make sure to check them out!",
					"086": "If you can't provide your hearthlings with prepared drinks yet, make sure to at least build them a water well.",
					"087": "Thirst will not hurt your citizens. Just their feelings!",
					"088": "Make sure to always offer alternatives to alcoholic drinks. No one wants all their citizens being excessively merry all day long!",
					"089": "Hearthlings will always prefer a drink that is more appropriate to the current time of the day, except when they really love something else.",
					"090": "Tea will greatly boost the qualities of all crafted products although it also makes crafting a bit slower. Balance requires patience!",
					"091": "Poisons and Toxins? Poisons last a long time and will slowly chip health away; Toxins disappear quickly but have more immediate effects.",
					"092": "Drinks like milk or juices are considered simple while more complex, flavorful brewings like spirits or beer are considered prepared.",
					"093": "Chitin armor can be crafted by the Weaver and will protect a lower level Footman against simple poisons and toxins.",
					"094": "Sleeping is important! Make sure to provide comfortable bedrooms and personally assigned beds for your hearthlings.",
					"095": "Dreaming of sheep rave parties? Click on your hearthlings while they're sleeping to see if they're having good or bad dreams...",
					"096": "Fruit and nut trees take a long time to mature but will bear their produce even when small. The longer they grow, the better their yield will be.",
					"097": "If starting during the Autumn, look around. There might be some extra food sources like nut trees before the winter!",
					"098": "You can temporarily pause a crafter queue by clicking the 'Open' sign on the top right of the crafting screen.",
					"099": "Crafted Bee Skeps require Captive Bees before they can work. Cut some trees and you might find a nest or two lying around!"
            }
         },
         "select_roster": {
            "reembark_button": "Reembark"
         }
		}
   },
   "data": {
      "hotkeys": {
         "keys": {
            "build_visdown": {
               "display_name": "Building Vis Down"
            }
         }
      }
   },
   "entities": {
      "crops": {
         "carrot_crop": {
            "growth_stage": {
               "000": {
                  "description": "An unrealized carrot."
               }
            }
         },
         "pumpkin_crop": {
            "growth_stage": {
               "000": {
                  "description": "An unrealized pumpkin."
               }
            }
         },
         "watermelon_crop": {
            "growth_stage": {
               "000": {
                  "description": "An unrealized watermelon."
               }
            }
         },
         "turnip_crop": {
            "growth_stage": {
               "000": {
                  "description": "An unrealized turnip."
               }
            }
         }
      }
   }
}